Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་དེ་དག་ཀྱང་འཚོ་བ་བདེ་བར་གྱུར་ཏེ། འདོད་ཆགས་ཆུང་། ཞེ་སྡང་ཆུང་། གཏི་མུག་ཆུང་།
en: The beings then were also jolly, and had little attachment, anger, or stupidity.

source: ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་དང་ལྡན། འཕགས་པས་བསྒྲུབས་པའི་ངོ་ཚ་དང་ལྡན་ཏེ།
en: They were modest, decent, and possessed the modesty achieved by noble beings.

source: གང་ཕལ་ཆེར་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེ་དང་ལས་ལྷན་ཅིག་བསགས་པ་ཡིན་ནོ། །
en: They also created karma primarily with reference to the thus-gone Stainless Zenith.

source: དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེ་བཞུགས་ནས་བསྙེན་བཀུར་བྱས།
en: There the thus-gone Stainless Zenith lived and was honored.

source: རྗེད་ཅིང་མཆོད་སྒྲ་གྲགས་སྙན་པ་ཡང་དག་པར་བྱུང་། གྲགས་པ་རྣམ་པར་གྲགས་ཏེ། ཇི་ལྟར་འདིར་འཕགས་པའི་སྐྱེ་བོ་ཡང་དག་པར་འདུ་བ་བྱུང་བ་བཞིན་ནོ། །
en: The pleasant sounds of reverence and worship reverberated, and it became widely reported how noble beings had gathered there.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་ཅིག་བྱུང་ངོ་། །
en: The thus-gone Stainless Zenith’s buddha realm contained inexpressibly many worlds.

source: དེར་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེ་གྲོང་ནས་གྲོང་དུ། གྲོང་ཁྱེར་ནས་གྲོང་ཁྱེར་དུ། གྲོང་རྡལ་ནས་གྲོང་རྡལ་དུ་སྤྱད་པ་སྤྱོད་དོ། །
en: Within them, the thus-gone Stainless Zenith carried out his acts from town to town, city to city, and village to village.

source: དེ་གང་དང་གང་དུ་གཤེགས་ནས་སླར་བཞུད་པའི་ཚེ་དེ་དག་ངུ་ཞིང་མཆི་མ་འབྱིན་ཏོ། །
en: Wherever he went, when it came time for him to depart again, there would be crying and weeping.

source: གང་དང་གང་དུ་གཤེགས་པ་དེ་དང་དེར་དགའ་བར་འགྱུར་ཏེ་ཡིད་དུ་འོང་ཞིང་བླ་མར་སེམས་སོ། །
en: Yet wherever he went there was joy and he was regarded as an agreeable teacher.

source: དེ་གང་དང་གང་དུ་ཆོས་སྟོན་པ་དེ་དང་དེར་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་མཐའ་ཡས་པ་དག་འདུལ་བར་འགྱུར་ཏེ།
en: All the countless quadrillions of sentient beings to whom he taught the Dharma became tamed.

source: ལ་ལ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པས། ལ་ལ་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས། ལ་ལ་ནི་བླ་ན་མེད་པ་སངས་རྒྱས་ཀྱི་ཐེག་པས་འདུལ་བར་མཛད་དོ། །
en: He guided some of them with the vehicle of the hearers, some of them with the vehicle of the solitary buddhas, and some of them with the unsurpassed vehicle of the buddhas.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེ་ཆོས་སྟོན་པ་ན་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསུང་ཞལ་ནས་འབྱུང་ཞིང་སྒྲ་དབྱངས་ཀྱི་ཡན་ལག་ལྔ་བརྒྱས་ཡང་དག་པར་བསྡུས་པ་དེ་མངོན་པར་བྱུང་བས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་མངོན་པར་གོ་བར་མཛད་དོ། །
en: When the thus-gone Stainless Zenith taught the Dharma, speech endowed with eight qualities emerged from his mouth and his voice contained the five hundred aspects of speech. Thus, as it emerged, it was understood throughout the entire buddha realm.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་ཆོས་སྟོན་པ་དེའི་ཚེ་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྤོས་ཆུས་ཆག་ཆག་བཏབ་པར་འགྱུར་རོ། །
en: When the thus-gone Stainless Zenith taught the Dharma, the entire buddha realm was sprinkled with perfumed water.

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཕྲིན་ལས་མངོན་པར་འདུ་མཛད་པས། གང་གི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེ་ཆོས་སྟོན་པ་དེའི་ཚེ་བར་སྣང་ལས་ལྷའི་སིལ་སྙན་གྱི་སྒྲ་དག་རབ་ཏུ་འབྱུང་ངོ་། །
en: As the Thus-Gone One was manifesting his activity, when the blessed thus-gone Stainless Zenith would teach the Dharma, the sounds of divine instruments came from the sky.

source: དེ་ལ་སེམས་ཅན་གང་འདོད་པ་ལ་དགའ་བ་དེ་དག་ནི་ཡིད་དུ་འོང་བའི་སྒྲ་དབྱངས་སྙན་ཅིང་བདེ་བ་ལ་མངོན་པར་དགའ་བ་དག་ཐོས་སོ། །
en: Whatever the beings there wished and enjoyed to hear, they would hear as pleasing, beautiful, and jubilant utterances, which they relished.

source: སྒྲ་དབྱངས་གང་ལྟ་བུ་ལ་དགའ་ཞིང་འདོད་པ་དེ་འདྲ་བའི་སྒྲ་ཐོས་སོ། །
en: Whatever utterances they enjoyed or desired, they would hear those very sounds.

source: གལ་ཏེ་མྱ་ངན་ལས་འདས་པའི་དགའ་བ་འདོད་ན་དགའ་བ་དེ་ཁ་ན་མ་ཐོ་བ་མེད་ཅིང་བདེ་བར་སོ་སོ་ཡང་དག་པར་མྱོང་བར་འགྱུར་རོ། །
en: If they desired the joy of nirvāṇa, they happily experienced its bliss, free of anything unwholesome.

source: སེམས་ཅན་གང་དག་ཆོས་འདོད་པར་གྱུར་ན་དེ་དག་མི་རྟག་པའི་སྒྲ་ཐོས་ཤིང་སྡུག་བསྔལ་གྱི་སྒྲ་དང་། བདག་མེད་པའི་སྒྲ་དང་། ཞི་བའི་སྒྲ་ཐོས་སོ། །མྱ་ངན་ལས་འདས་པའི་སྒྲ་ཐོས། སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་ཐོས་སོ། །
en: Those beings who desired the Dharma heard the words ‘impermanence,’ ‘suffering,’ ‘no-self,’ ‘peace,’ ‘nirvāṇa,’ ‘Buddha,’ ‘Dharma,’ and ‘Saṅgha.’

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒྲ་ཐོས་སོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པའི་སྒྲ་ཐོས་སོ། །
en: They heard the words ‘recollection of the Buddha,’ ‘recollection of the Dharma,’ ‘recollection of the Saṅgha,’ ‘recollection of discipline,’ ‘recollection of relinquishment,’ and ‘recollection of the deities.’

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཕྲིན་ལས་རྣམ་པར་སྨིན་པ་མངོན་པར་བསྒྲུབས་པ་ཉིད་ཀྱིས་ཆོས་ཉན་པ་དེ་དག་ལ་རླུང་བསིལ་བ་ལྡང་ངོ་། །
en: As the Thus-Gone One’s activity came to fruition, cool winds blew on those listening to the Dharma.

source: རླུང་བསིལ་བ་གང་དག་ལངས་པས་ཆོས་ཉན་པ་དག་དགའ་བ་སྐྱེའོ། །
en: A delight in hearing the Dharma arose in all those whom that wind touched.

source: གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་སྟོན་པ་ན། དེ་བཞིན་གཤེགས་པ་དེའི་རྣམ་པར་སྨིན་པ་མངོན་པར་གྲུབ་པའི་རླུང་ལངས་པ་དེ་ཉིད་ཀྱིས་དེའི་ཚེ་ཆོས་འདོད་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་སྒྲིབ་པ་ལྔ་ཐམས་ཅད་ནས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་ནས་ཐམས་ཅད་དུ་མི་འབྱུང་ངོ་། །
en: When the Thus-Gone One taught the Dharma, due to the stirring up of the wind brought about by Thus-Gone One, none of the five obscurations occurred at all in any respect among those who were seeking the Dharma.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེའི་རིམ་གྲོ་པ་དགེ་སློང་དཔལ་འབྱུང་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་ན་དེ་བཞིན་གཤེགས་པ་དེའི་སྣམ་ལོགས་ན་འདུག་པར་གྱུར་ཏེ་
en: “At that time the Thus-Gone One had an attendant, a monk named Śrīsambhava, who lived in the vicinity of the Thus-Gone One.

source: དེ་ཆོས་ལ་ཆུད་པའི་ཡིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་འཁོར་དེ་མཐོང་ངོ་། །
en: He regarded the Thus-Gone One’s retinue out of a wish to immerse himself in the Dharma.

source: གང་ལ་དཀྲུགས་པའི་སྒྲའམ། འཁྲུགས་པའི་སྒྲའམ། མ་དང་བའི་སྒྲ་མེད་ཅིང་དེ་རྣམ་པར་དང་བའི་ཡིད་ཀྱིས་སེམས་ཡང་དག་པར་བསྐྱེད་དེ་
en: He never said anything disturbing, agitated, or impure to anyone, and with a sincere attitude he genuinely engendered a proper resolve.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་ད་ལྟར་འཁོར་བཞི་དག་ལ་ཆོས་སྟོན་པ་ལྟར་བདག་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཁོར་གྱི་དཀྱིལ་འཁོར་འདི་ལྟ་བུས་ཡོངས་སུ་བསྐོར་ཅིང་ཆོས་སྟོན་པར་གྱུར་ཅིག་སྙམ་མོ། །
en: He thought, ‘Just like the thus-gone Stainless Zenith now teaches the Dharma to the fourfold retinue, in the future may I become a Dharma teacher, perfecting all the qualities of a thus-gone and become surrounded by such an entourage as this!’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེས་རིམ་གྲོ་པ་དགེ་སློང་དེའི་བསམ་པ་ལ་གཟིགས་ནས་འོད་བཏང་ངོ་། །
en: The thus-gone Stainless Zenith was aware of the monk-attendant’s thoughts and emitted light.

source: འོད་གང་གིས་རེག་མ་ཐག་ཏུ་དགེ་སློང་དཔལ་འབྱུང་དེ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པོ། །
en: As that light struck the monk Śrīsambhava, he immediately achieved the absorption of great compassion.

source: ཏིང་ངེ་འཛིན་གང་གི་མཐུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Due to that absorption, he became irreversible from unsurpassed and perfect awakening.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དཔལ་འབྱུང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva Śrīsambhava was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དཔལ་འབྱུང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Śrīsambhava.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སྙོམས་པར་འཇུག་པའི་མཁས་པ་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should cultivate skill in equilibrium.

source: མཽད་གལ་གྱི་བུ་ངས་སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ལ་སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྒྱ་ཆེ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous great roots of virtue in order to understand the origin as related to knowledge of equilibrium. I did this by thinking, ‘How can I fully awaken to unsurpassed and perfect buddhahood and then properly teach beings how to understand the origin as related to knowledge of equilibrium?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་བྲམ་ཟེ་དྲི་མེད་མིག་ཅེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a brahmin named Stainless Eyes.

source: ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཕྱུག་ཅིང་ནོར་ཆེ་ལ་ལོངས་སྤྱོད་ཆེ་བ་ལོངས་སྤྱོད་མང་བ། བདག་གིར་བྱ་བ་མང་བ། ནོར་དང་ཡོ་བྱད་མང་བ།
en: He was a great householder who was rich, affluent, wealthy, and prosperous. He had amassed many possessions, a great fortune, and many resources.

source: ཕ་མ་གཙང་བ། ཆུང་མ་གཙང་བ། མངལ་གྱི་སྐྱོན་གྱིས་མ་གོས་པ་རིགས་དམའ་བའི་ཁ་ན་མ་ཐོ་བ་མེད་པ།
en: He was born of pure parentage and had a wife who was likewise pure. He was untainted by the flaws of the womb and was free of all the unwholesomeness of lower castes.

source: འདོན་པ་པོ་གཞུང་འཛིན་པ་རིག་པ་གསུམ་དང་། སྒྲ་ངེས་པར་སྦྱོར་བ་དང་བཅས་པ། ཤེས་གསལ་དང་བཅས་པ། ཡི་གེ་དང་བཅས་པ། རབ་ཏུ་དབྱེ་བ་དང་བཅས་པ་ལྔ་པ་སྟེ། སྔོན་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནས་དང་བརྡ་སྤྲོད་པ་དང་། འཇིག་རྟེན་རྒྱང་ཕན་པ་དང་། མཆོད་སྦྱིན་གྱི་རྒྱུད་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཉིད་ཀྱི་རྒྱུད་རིག་པ་གསུམ་གྱི་གསུང་རབ་ལ་སོ་སོའི་སློབ་དཔོན་རྣམས་ཀྱིས་རྗེས་སུ་གནང་བ་ཞིག་བྱུང་ངོ་། །
en: He had been educated by individual teachers in the instructions of the three types of knowledge related to reciting and upholding scripture, linguistics, ritual science, grammar, the Fifth including its subdivisions, the topics of the past adepts, rhetoric, the Lokāyata system, the scriptures on sacrifice, and the three types of knowledge related to the scriptures on the characteristics of great men.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བཅིངས་པ་ཐམས་ཅད་རབ་ཏུ་རྣམ་པར་འགྲོལ་བ་ཞེས་བྱ་བ་ནས།
en: “At that time there had appeared in the world a thus-gone one named Freed from All Fetters;

source: དེ་བཞིན་གཤེགས་པ་བཅིངས་པ་ཐམས་ཅད་རབ་ཏུ་རྣམ་པར་འགྲོལ་བ་དེའི་གསུང་རབ་དེ་ལ་སེམས་ཅན་རྣམས་ཀྱི་ཚེའི་ཚད་དཔག་ཏུ་མེད་པར་གྱུར་ཏོ། །
en: The beings present for the teachings of the thus-gone Freed from All Fetters lived unfathomably long lives.

source: དེ་བཞིན་གཤེགས་པ་བཅིངས་པ་ཐམས་ཅད་རབ་ཏུ་རྣམ་པར་འགྲོལ་བ་དེའི་ཉན་ཐོས་ཀྱི་འཁོར་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་དག་བྱུང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དཔག་ཏུ་མེད་པ་དག་བྱུང་ངོ་། །
en: The thus-gone Freed from All Fetters had a following of countless thousands of hearers and innumerable bodhisattvas.

source: དེར་དེ་བཞིན་གཤེགས་པ་བཅིངས་པ་ཐམས་ཅད་རབ་ཏུ་རྣམ་པར་འགྲོལ་བ་དེ་སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལས་བརྩམས་ནས་ཆོས་སྟོན་ཏེ།
en: To them the thus-gone Freed from All Fetters gave this Dharma teaching concerning knowledge of the origin as related to knowledge of equilibrium:

source: བྱང་ཆུབ་སེམས་དཔས་ཏིང་ངེ་འཛིན་ལ་མཁས་པར་བྱ།
en: “ ‘Bodhisattvas should be skilled in absorption.

source: སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་ཡང་མཁས་པར་བྱའོ། །
en: They should be skilled in understanding the origin as related to knowledge of equilibrium.

source: དགེ་སློང་དག་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་མཁས་པར་བྱ་ཞེ་ན།
en: Monks, you may wonder how bodhisattvas should become skilled in understanding the origin as related to knowledge of equilibrium.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་བསམ་གཏན་དང་པོའི་རྗེས་སུ་འཐུན་པའི་ཆོས་རྣམས་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: Bodhisattvas should endeavor in the dharmas that are conducive to the first concentration.

source: བསམ་གཏན་དང་པོ་དེ་ནི་གང་ཡིན།
en: What is the first concentration?

source: བསམ་གཏན་དང་པོ་དེ་ལ་ཇི་ལྟར་སྙོམས་པར་འཇུག་པའི་མིང་འཐོབ་ཅེ་ན།
en: And why is the first concentration referred to as equilibrium ?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟར་རབ་ཏུ་ཤེས་པར་བྱ་སྟེ། འདོད་པའི་རྣམ་པར་རྟོག་པ་ལས་ངེས་པར་འབྱུང་བ་ནི་རྣམ་པར་རྟོག་པའི་གཉེན་པོའོ། །
en: Concerning this, bodhisattvas should understand that escape from desirous thoughts constitutes a remedy to conceptualization.

source: ངེས་པར་འབྱུང་བའི་རྣམ་པར་རྟོག་པ་དེས་འདོད་པའི་རྣམ་པར་རྟོག་པ་བཟློག་སྟེ། དེ་འདིའི་གཉེན་པོའོ། །
en: Such notions of escaping desire reverse desirous thoughts and remedy them.

source: སྙོམས་པར་འཇུག་པས་དེ་ལ་སྙོམས་པར་འཇུག་པ་ཞེས་བྱའོ། །
en: Because one is poised in equanimity, it is known as “equilibrium.”

source: གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པའི་གཉེན་པོ་ནི་གནོད་སེམས་མེད་པའི་རྣམ་པར་རྟོག་པ་སྟེ།
en: The antidote for malicious thoughts is thinking free of malice.

source: དེ་འདི་ལ་སྙོམས་པར་འཇུག་པ་ཡིན་པས་དེ་ལ་སྙོམས་པར་འཇུག་པ་ཞེས་བྱའོ། །
en: Because one is poised in equanimity within that, it is known as “equilibrium.”

source: རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པའི་གཉེན་པོར་ནི་རྣམ་པར་འཚེ་བ་མེད་པའི་རྣམ་པར་རྟོག་པ་སྟེ།
en: The antidote for violent thoughts is non-violent thinking.

source: རྣམ་པར་འཚེ་བ་མེད་པའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པ་ཟློག་པར་བྱེད་དོ། །
en: Violent thoughts are undermined by non-violent thoughts.

source: དེ་འདི་ལ་སྙོམས་པར་འཇུག་པ་ཡིན་པས་དེ་ལ་སྙོམས་པར་འཇུག་པ་ཞེས་བྱ་སྟེ། །
en: Because one is poised in equanimity within that, it is known as “equilibrium.”

source: དེས་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་གོ། །
en: In that way, one rests evenly in the first concentration.

source: བསམ་གཏན་གཉིས་པའི་གཉེན་པོ་ནི་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་ཡིན་ལ་དེ་དག་གི་གཉེན་པོ་ནི་ཏིང་ངེ་འཛིན་གྱིས་བསྐྱེད་པའི་དགའ་བ་ཡིན་ནོ། །
en: The antidotes for the second concentration are thought and discernment, while the antidote for those is joy produced through absorption.

source: བསམ་གཏན་གསུམ་པའི་ཏིང་ངེ་འཛིན་གྱིས་བསྐྱེད་པའི་དགའ་བའི་གཉེན་པོ་ནི་དེའི་དགའ་བ་མེད་པ་བདེ་བའི་གཉེན་པོ་སྟེ།
en: The antidote for the third concentration’s joy produced through absorption is the remedy that consists of joyless bliss.

source: དེ་འདི་ལ་སྙོམས་པར་འཇུག་པ་ཡིན་པས་དེ་ལྟ་བས་ན་སྙོམས་པར་འཇུག་པ་ཞེས་བྱའོ། །
en: Because one is poised in equanimity within that, it is known as “equilibrium.”

source: བསམ་གཏན་བཞི་པ་ལ་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་འཇུག་སྟེ་དེ་ནི་བདེ་བ་དང་སྡུག་བསྔལ་གྱི་གཉེན་པོའོ། །
en: In the fourth concentration one perceives without any pleasure or pain, which is the antidote for pleasure and pain.

source: དེ་འདི་ལ་སྙོམས་པར་འཇུག་པ་ཡིན་པས་དེ་ལ་སྙོམས་པར་འཇུག་པ་ཞེས་བྱའོ།། །།
en: Because one is poised in equanimity within that, it is known as “equilibrium.”

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་གཉེན་པོ་ནི་གཟུགས་ཀྱི་འདུ་ཤེས་དང་། ཐོགས་པའི་འདུ་ཤེས་སོ། །
en: “ ‘The antidote for the sense sphere of infinite space is the perception of form and the perception of materiality.

source: དེའི་གཉེན་པོ་ནི་ནམ་མཁའི་འདུ་ཤེས་སྙོམས་པར་འཇུག་པ་ཞེས་བྱའོ། །
en: The antidote for that is equilibrium in the perception of space.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་གཉེན་པོ་ནི་ནམ་མཁའི་འདུ་ཤེས་སོ། །
en: The antidote for the sense sphere of infinite consciousness is the perception of space.

source: ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་གཉེན་པོ་ནི་རྣམ་ཤེས་ཀྱི་འདུ་ཤེས་སོ། །
en: The antidote for the sense sphere of nothing whatsoever is the perception of consciousness.

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་གཉེན་པོ་ནི་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་དོ། །
en: The antidote for the sense sphere of neither absence nor presence of perception is the sense sphere of nothing whatsoever.

source: འགོག་པ་ལ་སྙོམས་པར་འཇུག་པའི་གཉེན་པོ་ནི་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་དོ། །
en: The antidote for equilibrium in cessation is the sense sphere of neither absence nor presence of perception.

source: དེའི་ཀུན་འབྱུང་གང་ཞེ་ན་
en: What is the source of that?

source: འདི་ལྟ་སྟེ་འདུན་པའོ། །སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པའི་རྒྱུ་ནི་འདུན་པའོ། །
en: It is intention—intention is the cause of understanding the origin as related to knowledge of equilibrium.’

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཟབ་མོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དེའི་སྣམ་ལོགས་ན་འདུག་ཅིང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་བསིལ་ཡབ་ཀྱིས་གཡོབ་བོ། །
en: “At that time, living in the Thus-Gone One’s entourage was a bodhisattva named Profound Intelligence, who cooled the Thus-Gone One with a fan.

source: བདག་མ་འོངས་པའི་དུས་ན་མ་དུལ་བ་རྣམས་འདུལ་བ་དང་། མ་ཞི་བ་རྣམས་ཞི་བར་བྱེད་པ་དང་། བཅིངས་པ་རྣམས་གྲོལ་བར་བྱེད་པ་དང་། མ་རྒལ་བ་རྣམས་སྒྲོལ་བར་བྱེད་པའི་དེ་བཞིན་གཤེགས་པར་གྱུར་ཅིག་སྙམ་མོ། །
en: ‘In the future may I become a thus-gone one and guide those who are lost, calm those who have not been calmed, free those who are bound, and liberate those who have not crossed over.’

source: བྲམ་ཟེ་དྲི་མ་མེད་པའི་མིག་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ་བདག་མ་འོངས་པའི་དུས་ན་མ་དུལ་བ་རྣམས་འདུལ་བ་དང་། མ་ཞི་བ་རྣམས་ཞི་བར་བྱེད་པ་དང་། བཅིངས་པ་རྣམས་གྲོལ་བར་བྱེད་པ་དང་། མ་རྒལ་བ་རྣམས་སྒྲོལ་བར་བྱེད་པའི་དེ་བཞིན་གཤེགས་པར་གྱུར་ཅིག་སྙམ་མོ། །
en: “The brahmin Stainless Eyes, who was similar to a sal tree, likewise had the thought, ‘In the future may I become a thus-gone one and guide those who are lost, calm those who have not been calmed, free those who are bound, and liberate those who have not crossed over.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་བཅིངས་པ་ཐམས་ཅད་རབ་ཏུ་རྣམ་པར་འགྲོལ་བ་ཞེས་བྱ་བས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འཛིན་པ་གཉིས་ལ་ཆེད་དུ་བརྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ། །
en: “The thus-gone Freed from All Fetters then expressed these words to the two men who had assumed the role of bodhisattvas:

source: སེམས་ཅན་གང་དག་སྡུག་བསྔལ་མཐོང་ནས་སྙིང་རྗེ་ཆེ་སྐྱེས་པ། །དེ་དག་རིན་ཆེན་ཀུན་གྱིས་མཆོད་པ་བྱས་པས་དེ་མི་ནུས།
en: “ ‘Even with all riches, one cannot adequately honor The one who sees the sorrows of beings and feels great compassion.

source: གང་ཚེ་སེམས་ཅན་ཀུན་གྱིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ཏུ་མེད། །བུས་ནས་བདེ་གཤེགས་མཆོད་ཀྱང་དེ་ཡིས་མཆོད་པར་མི་འགྱུར་རོ། །
en: All beings may honor the Thus-Gone One with fires lit throughout the worlds In the ten directions, and yet it will never be a sufficient honor.

source: དེ་ཡི་སེམས་གཅིག་བསྐྱེད་པའི་ཡོན་ཏན་མཐའ་དག་ཚིག་གིས་སུ། །བརྗོད་པར་མི་ནུས་ཡོན་ཏན་ཟད་པར་བྱ་ལྟ་ག་ལ་ནུས། །
en: “ ‘All the positive qualities of a single thought of his cannot be told in words, Let alone could those qualities be exhausted.

source: དེ་ལྟ་བས་ན་མཁས་པའི་མི་ཡིས་སངས་རྒྱས་ཆོས་ཚོལ་ན། །ཡོན་ཏན་རྣམས་ལ་འབད་བྱ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཆོད། །
en: Thus wise men, who seek the Buddha’s Dharma, Should endeavor in such qualities and honor those of the Thus-Gone One.

source: སངས་རྒྱས་ཆོས་ཚོལ་བ་ན་དེས་ནི་ལུས་ལ་བསྲུངས་པ་མེད། །
en: “ ‘In seeking the Buddha’s Dharma, there is no protecting the body.

source: འདྲེན་པའི་གཏོང་ལ་བསླབས་པས་ཡང་དང་ཡང་དུ་ཡོངས་བཏང་ངོ་། །
en: Training in the giving of the Guide, give again and again.

source: རྐང་གཉིས་མཆོག་ནི་དངོས་པོ་ཀུན་ལ་ཡོངས་སུ་བསླབས་པས་སུ། །
en: The foremost of humans has trained in all things

source: འདི་ལྟར་སངས་རྒྱས་ཆོས་ཉིད་བྱང་ཆུབ་མཆོག་ནི་ང་ཡིས་བརྙེས། །གང་དག་ཆོས་རྣམས་སྐྱེ་བ་ཇི་ལྟ་བཞིན་དུ་རྣམ་ཤེས་ན། །
en: And thus have I achieved supreme awakening, the nature of the buddhas.

source: བུ་དེ་མི་ཡི་དབང་པོ་ཡབ་ཀྱི་རིགས་ནི་འཕེལ་བར་བྱེད། །
en: “ ‘The children who understand how things arise Will propagate the lineage of their father, the Lord of Men.

source: མཉམ་པའི་ཆོས་རྟོགས་པ་ནི་བདུད་ཀྱིས་བཅིངས་པ་གཅོད་བྱེད་ཅིང་། །བདུད་ཀྱི་ཞགས་པ་ལས་གྲོལ་སེམས་ཅན་གཞན་ཡང་རབ་གྲོལ་བྱེད། །
en: To realize the Dharma of equality is to break the fetters of Māra, Escape from the noose of Māra, and even free other beings.

source: དེ་ལྟ་བས་ན་བྱང་ཆུབ་ཚོལ་བས་དངོས་ཀུན་ཡོངས་སུ་སྤོང་། །
en: “ ‘Thus, those who seek awakening should give up all things.

source: བྱང་ཆུབ་ཞི་བ་ཚོལ་ན་ཆོས་ཀྱི་ཚུལ་ལ་བསླབ་པར་གྱིས། །
en: If you seek the peace of awakening, train in the way of Dharma.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་བཅོམ་ལྡན་འདས་ཀྱིས་རྗེས་སུ་བསྟན་པ་ཐོས་ནས། དེའི་ཚེ་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ལ་བློ་ངེས་ཤིང་དེ་གཉིས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: “When they heard the teaching given by the Blessed One, the two bodhisattvas resolved to give up everything and both of them reached non-regression.

source: དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་དྲི་མེད་མིག་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the brahmin called Stainless Eyes, who was similar to a sal tree, was anyone else, do not think so.

source: དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་དེ། དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་དྲི་མེད་མིག་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: Because in those days the thus-gone Kāśyapa was the great brahmin householder called Stainless Eyes.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཟབ་མོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva called Profound Intelligence was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཟབ་མོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva called Profound Intelligence.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སྙོམས་པར་འཇུག་པ་ལ་མཁས་པར་བྱ་ཞིང་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should be skilled in equilibrium and likewise train as bodhisattvas.

source: མཽད་གལ་གྱི་བུ་ངས་སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous roots of virtue in order to understand cessation as related to knowledge of equilibrium. I did this by thinking, ‘How can I fully awaken to unsurpassed and perfect buddhahood and then teach beings how to understand cessation as related to knowledge of equilibrium?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་རྡུལ་དང་དྲི་མ་དང་མུན་པ་འཇོམས་པ་ཞེས་བྱ་བ་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone one named Vanquisher of Dust Stains and Darkness.

source: དེ་བཞིན་གཤེགས་པ་རྡུལ་དང་དྲི་མ་དང་མུན་པ་འཇོམས་པ་དེའི་སྐུ་ཚེའི་ཚད་ནི་ལོ་སྟོང་ཕྲག་བརྒྱད་ཅུར་གྱུར་ཏོ། །
en: He would live to be eighty thousand years.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྡུལ་དང་དྲི་མ་དང་མུན་པ་འཇོམས་པ་དེའི་ཉན་ཐོས་འདུས་པ་གསུམ་བྱུང་སྟེ།
en: The thus-gone, worthy, perfect buddha Vanquisher of Dust Stains and Darkness had three assemblies of hearers.

source: ཉན་ཐོས་འདུས་པ་གཅིག་ནི་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ་མཉམ་པ་ཉིད་ཤེས་ཤིང་རྣམ་པར་གྲོལ་བའི་བར་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་གོ། །
en: The first assembly was composed of worthy ones whose defilements were exhausted . . . who understood equality and were free, and numbered nine hundred sixty million.

source: གཉིས་པ་ནི་དགུ་བཅུ་རྩ་བཞིའོ། །
en: The second assembly numbered nine hundred forty million,

source: གསུམ་པ་ནི་དགུ་བཅུ་རྩ་གཉིས་སོ། །
en: while the third assembly numbered nine hundred twenty million.
